# Задача 40. Заменить в слове букву «a» на «u».

# Введите слово
word = input("Введите слово: ")

# Заменяем все буквы 'а' на 'u'
new_word = word.replace('a', 'u')

# Выводим результат
print("Измененное слово:", new_word)
