# Задача 38.
# Написать программу, которая запрашивает имя и здоровается с ним.

name = input("Введите ваше имя: ")
print(f"Привет, {name}!")
