# Задача 22. Сумма ряда-2
# Даны вещественные числа a[1],..., a[n].
# Известно, что среди них есть отрицательные.
# Пусть первый среди отрицательных членов имеет номер a[k+1].
# Вычислить a[1] + +2*a[2]+ + 2*a[3] + ... + 2*a[k-1] + a[k].

import random

n = 100
a = [0] * n
i = 0
k = 0
s = 0

for i in range(n):
    a[i] = random.randint(-20, 19)
    print(f"{a[i]:4}", end="")
print()

i = 0
s = 0

while a[i] >= 0:
    if i == 0:
        s += a[0]
    else:
        s += 2 * a[i]
    i += 1

if i > 2:
    s -= a[i - 1]

print(s)
